[
  {
    "server": "jira",
    "name": "jira.search_issues",
    "description": "Advanced enterprise Jira issue search with complex JQL (Jira Query Language) queries, comprehensive filtering, field expansion, and result customization. Supports searching across multiple projects, issue types, and custom fields with advanced operators, date arithmetic, and function-based queries. Returns detailed issue metadata including comments, attachments, work logs, links, and custom field values. Includes support for complex aggregations, temporal queries, and cross-project issue relationships. Provides audit trail information, security context validation, and compliance-aware field filtering based on user permissions and data classification levels."
  },
  {
    "server": "jira",
    "name": "jira.get_issue",
    "description": "Retrieve comprehensive details for a specific Jira issue including all fields, comments, attachments, work logs, and issue history. Returns structured data with custom field values, transitions, and related issue information. Includes security and permission context."
  },
  {
    "server": "jira",
    "name": "jira.create_issue",
    "description": "Create comprehensive incidents, critical service requests, emergency escalations, and high-priority bugs for system outages and application failures. This tool provides complete incident creation capabilities including priority assignment, user assignment, component association, label management, custom field population, attachment uploads, and initial comment addition. The system automatically triggers notification workflows, applies configured business rules, validates field constraints, and ensures proper permission checks. Returns detailed issue information including assigned key, creation timestamp, workflow status, and access URLs for immediate follow-up actions. Supports integration with external monitoring systems and automated escalation policies for critical production incidents."
  },
  {
    "server": "jira",
    "name": "jira.update_issue",
    "description": "Update existing issues with field modifications including status changes, priority adjustments, assignee updates, and custom field values. Supports bulk field updates with validation and automatic workflow triggers. Maintains audit trail of all changes with timestamps and user attribution."
  },
  {
    "server": "jira",
    "name": "jira.transition_issue",
    "description": "Change issue status through configured workflow transitions with validation of required fields, conditions, and permissions. Supports automatic field population during transitions and custom workflow actions. Returns updated issue status and available next transitions."
  },
  {
    "server": "jira",
    "name": "jira.get_comments",
    "description": "Retrieve all comments and activity history for a specific issue with author information, timestamps, and comment body content. Returns threaded conversations, @mentions, and comment metadata. Supports filtering by author, date range, and comment visibility levels."
  },
  {
    "server": "jira",
    "name": "jira.add_comment",
    "description": "Add comments and updates to existing issues with rich text formatting, @mentions, and attachment support. Comments can include visibility restrictions, automatic @mentions of watchers, and integration with external systems. Supports threaded replies and comment editing permissions."
  },
  {
    "server": "jira",
    "name": "jira.get_projects",
    "description": "List all accessible Jira projects with detailed configuration information including project keys, names, descriptions, lead information, and project-specific settings. Returns issue type schemes, workflow configurations, custom fields, and permission schemes associated with each project."
  },
  {
    "server": "jira",
    "name": "jira.manage_project_config",
    "description": "Configure project settings including issue types, workflows, custom fields, and permission schemes. Supports project creation, modification, and configuration management with validation and rollback capabilities."
  },
  {
    "server": "jira",
    "name": "jira.manage_automation_rules",
    "description": "Create, modify, and manage automation rules for issue processing, notifications, and workflow automation. Supports complex rule conditions, multi-step actions, and integration with external systems. Returns rule execution status and performance metrics."
  },
  {
    "server": "jira",
    "name": "jira.get_automation_logs",
    "description": "Retrieve automation rule execution logs including success/failure status, execution time, and error details. Supports filtering by rule, time period, and execution status for troubleshooting and performance analysis."
  },
  {
    "server": "jira",
    "name": "jira.create_dashboard",
    "description": "Create and configure dashboards with custom gadgets for issue tracking, team performance, and project analytics. Supports real-time widgets, custom filters, and sharing permissions. Returns dashboard configuration and access URLs."
  },
  {
    "server": "jira",
    "name": "jira.generate_reports",
    "description": "Generate comprehensive reports including burndown charts, velocity reports, control charts, and custom analytics. Supports multiple report formats, scheduling, and automated distribution. Returns report data and visualization URLs."
  },
  {
    "server": "jira",
    "name": "jira.monitor_sla",
    "description": "Monitor Service Level Agreement compliance including response times, resolution times, and breach warnings. Provides real-time SLA status, historical performance, and escalation triggers for critical issues."
  },
  {
    "server": "jira",
    "name": "jira.escalate_issue",
    "description": "Automatically escalate issues based on SLA breaches, priority changes, or custom escalation rules. Supports multi-level escalation, notification chains, and manager involvement. Returns escalation status and notification results."
  },
  {
    "server": "jira",
    "name": "jira.sync_external_system",
    "description": "Synchronize issue data with external systems including monitoring tools, chat platforms, and other service management platforms. Supports bidirectional sync, field mapping, and conflict resolution."
  },
  {
    "server": "confluence",
    "name": "confluence.search_content",
    "description": "Search across all Confluence spaces for pages, blog posts, attachments, and comments using full-text search with advanced filtering. Returns content summaries, space information, author details, and relevance scoring. Supports content type filtering, space restrictions, and date-based queries."
  },
  {
    "server": "confluence",
    "name": "confluence.get_page",
    "description": "Retrieve complete page content including body text, metadata, version history, and space information. Returns structured content with macro expansions, embedded media, and table data. Includes page hierarchy, labels, comments, and attachment listings with access permissions."
  },
  {
    "server": "confluence",
    "name": "confluence.create_page",
    "description": "Create new documentation pages and runbooks with rich content including tables, macros, embedded media, and cross-references. Supports template-based creation, automatic labeling, and permission inheritance from parent pages. Returns created page details with edit links."
  },
  {
    "server": "confluence",
    "name": "confluence.update_page",
    "description": "Update existing page content, metadata, and structure with version control and change tracking. Supports partial content updates, label management, and permission modifications. Maintains complete revision history with diff capabilities and rollback options."
  },
  {
    "server": "confluence",
    "name": "confluence.list_pages",
    "description": "List all pages within a space with filtering and sorting options. Returns page hierarchy, creation dates, author information, and content status. Supports filtering by labels, page status, and creation date ranges. Includes pagination and bulk metadata retrieval."
  },
  {
    "server": "confluence",
    "name": "confluence.get_space",
    "description": "Get comprehensive space information including description, homepage, permissions, and content statistics. Returns space configuration, theme settings, user access levels, and content organization structure. Includes recent activity and space-level analytics."
  },
  {
    "server": "confluence",
    "name": "confluence.create_space",
    "description": "Create new Confluence spaces with customizable templates, permissions, and initial content structure. Supports space categories, homepage creation, and user group assignments. Returns space configuration and access URLs."
  },
  {
    "server": "confluence",
    "name": "confluence.manage_space_permissions",
    "description": "Configure space-level permissions including view, edit, delete, and admin access for users and groups. Supports permission inheritance, role-based access control, and audit logging. Returns current permission matrix and change history."
  },
  {
    "server": "confluence",
    "name": "confluence.manage_templates",
    "description": "Create, modify, and manage page templates for consistent content creation. Supports global and space-specific templates with variable substitution, form fields, and conditional content. Returns template usage statistics and version history."
  },
  {
    "server": "confluence",
    "name": "confluence.manage_labels",
    "description": "Create, apply, and manage labels for content organization and discovery. Supports hierarchical labeling, auto-labeling rules, and label analytics. Returns label usage statistics and content associations."
  },
  {
    "server": "confluence",
    "name": "confluence.get_analytics",
    "description": "Retrieve comprehensive analytics including page views, user engagement, content performance, and space activity. Supports trend analysis, user behavior tracking, and content optimization recommendations."
  },
  {
    "server": "confluence",
    "name": "confluence.export_content",
    "description": "Export Confluence content in various formats including PDF, Word, XML, and HTML. Supports bulk export, custom styling, and automated scheduling. Returns export status and download links."
  },
  {
    "server": "m365",
    "name": "m365.search_email",
    "description": "Search across Exchange Online mailboxes for email messages and conversations with advanced filtering capabilities. Returns message summaries, sender/recipient information, timestamps, and attachment details. Supports complex queries with date ranges, folder restrictions, and content-based filtering."
  },
  {
    "server": "m365",
    "name": "m365.send_email",
    "description": "Send executive notifications, leadership communication, and critical system alerts through Exchange Online for system outages and service disruptions. Supports rich formatting, attachment support, delivery confirmation, executive briefings, and incident status updates. Supports bulk sending, template-based emails, and integration with organizational policies. Handles priority levels, read receipts, compliance requirements, and executive escalation workflows."
  },
  {
    "server": "m365",
    "name": "m365.manage_mailbox",
    "description": "Administer Exchange Online mailboxes including quota management, folder permissions, and retention policies. Supports mailbox migration, backup/restore operations, and compliance configuration. Returns mailbox statistics and configuration details."
  },
  {
    "server": "m365",
    "name": "m365.get_calendar",
    "description": "Retrieve calendar events and meeting information from Outlook calendars with detailed attendee lists, recurring event handling, and room/resource booking details. Returns event summaries, locations, time zones, and meeting response status. Supports multiple calendar views and filtering options."
  },
  {
    "server": "m365",
    "name": "m365.create_event",
    "description": "Create calendar events and meetings in Outlook with comprehensive scheduling features including attendee management, room booking, recurring events, and meeting options. Supports Teams meeting integration, resource allocation, and automated invitation sending with rich meeting details."
  },
  {
    "server": "m365",
    "name": "m365.manage_room_booking",
    "description": "Book and manage conference rooms and resources with availability checking, equipment requests, and catering coordination. Supports recurring bookings, resource conflicts resolution, and booking policies enforcement."
  },
  {
    "server": "m365",
    "name": "m365.search_teams",
    "description": "Search Microsoft Teams chat messages, channel conversations, and shared files across teams and channels. Returns message content, author information, timestamps, reactions, and thread context. Supports filtering by team, channel, date range, and message type with compliance and retention awareness."
  },
  {
    "server": "m365",
    "name": "m365.send_teams_message",
    "description": "Send messages to Microsoft Teams channels or direct chats with rich formatting, @mentions, file attachments, and adaptive card support. Handles message threading, reactions, and integration with Teams apps and workflows. Supports both personal and channel communications."
  },
  {
    "server": "m365",
    "name": "m365.manage_teams",
    "description": "Create, configure, and manage Microsoft Teams including member management, channel creation, app installation, and policy enforcement. Supports team templates, guest access, and integration with Azure AD groups."
  },
  {
    "server": "m365",
    "name": "m365.manage_sharepoint_sites",
    "description": "Create, configure, and manage SharePoint sites including document libraries, lists, permissions, and site collections. Supports site templates, hub site associations, and content migration. Returns site statistics and configuration details."
  },
  {
    "server": "m365",
    "name": "m365.search_sharepoint_content",
    "description": "Search across SharePoint sites for documents, lists, and content with comprehensive filtering and relevance ranking. Returns content summaries, metadata, author information, and access permissions. Supports advanced query syntax and result refinement."
  },
  {
    "server": "m365",
    "name": "m365.get_contacts",
    "description": "Retrieve contact information from Azure Active Directory and personal contact lists including distribution groups, organizational hierarchy, and contact metadata. Returns comprehensive contact details with phone numbers, addresses, titles, and organizational relationships."
  },
  {
    "server": "m365",
    "name": "m365.manage_user_accounts",
    "description": "Administer Azure AD user accounts including provisioning, license assignment, group membership, and authentication settings. Supports bulk operations, automated workflows, and compliance reporting. Returns user status and activity information."
  },
  {
    "server": "m365",
    "name": "m365.manage_power_apps",
    "description": "Create, deploy, and manage Power Apps applications with data source connections, user permissions, and environment configuration. Supports app sharing, version control, and usage analytics. Returns app status and performance metrics."
  },
  {
    "server": "m365",
    "name": "m365.run_power_automate",
    "description": "Execute Power Automate workflows for business process automation including data synchronization, approval workflows, and notification systems. Supports flow triggering, parameter passing, and execution monitoring."
  },
  {
    "server": "datadog",
    "name": "datadog.query_metrics",
    "description": "Execute advanced time-series metric queries against Datadog monitoring infrastructure with comprehensive aggregation functions, mathematical operations, anomaly detection, and multi-dimensional filtering. Supports complex metric expressions, custom functions, percentile calculations, rate computations, and cross-metric correlation analysis. Provides statistical analysis including trend detection, seasonality analysis, and outlier identification. Includes support for SLI/SLO calculations, capacity planning analytics, and predictive forecasting. Returns enriched metric data with metadata, quality indicators, and contextual information for enterprise observability workflows."
  },
  {
    "server": "datadog",
    "name": "datadog.get_infrastructure_list",
    "description": "Retrieve comprehensive list of monitored infrastructure including hosts, containers, services, and cloud resources. Returns detailed information about system health, tags, metadata, and current status. Supports filtering by environment, service, or custom tags."
  },
  {
    "server": "datadog",
    "name": "datadog.get_host_details",
    "description": "Get detailed information about specific hosts including system metrics, installed agents, running processes, and network connections. Returns comprehensive host health status, performance metrics, and configuration details."
  },
  {
    "server": "datadog",
    "name": "datadog.trace_search",
    "description": "Search distributed traces for application performance analysis, request flow error investigation, and HTTP status debugging. Returns trace spans, timing information, error details, and service dependencies. Supports filtering by service, operation, error status, and custom tags for root cause analysis of application failures."
  },
  {
    "server": "datadog",
    "name": "datadog.get_service_map",
    "description": "Retrieve service dependency map showing relationships between microservices, external dependencies, and data flow patterns. Returns service topology, performance metrics, and error rates for each service connection."
  },
  {
    "server": "datadog",
    "name": "datadog.analyze_service_performance",
    "description": "Analyze service performance including latency percentiles, HTTP error rates, request throughput, and resource utilization during application processing. Provides performance baseline comparison, anomaly detection, root cause analysis for service errors, and optimization recommendations for system performance."
  },
  {
    "server": "datadog",
    "name": "datadog.create_monitor",
    "description": "Create custom monitors for infrastructure and application alerting with complex conditions, multi-alert support, and escalation policies. Supports threshold-based, anomaly detection, and forecasting monitors with customizable notification channels."
  },
  {
    "server": "datadog",
    "name": "datadog.get_monitor_status",
    "description": "Retrieve current status and history for monitors including alert states, trigger events, and resolution information. Returns detailed monitor health, performance metrics, and notification logs with troubleshooting information."
  },
  {
    "server": "datadog",
    "name": "datadog.manage_monitor_downtime",
    "description": "Schedule and manage monitor downtime periods for maintenance windows, deployments, or testing. Supports recurring downtime schedules, partial monitor muting, and automated downtime management."
  },
  {
    "server": "datadog",
    "name": "datadog.search_logs",
    "description": "Search and analyze log data for error investigation, application failures, HTTP status code analysis, and system debugging. Returns log events with context, metadata, and statistical analysis. Supports complex queries, time-based filtering, log correlation, and root cause analysis for service errors and performance issues."
  },
  {
    "server": "datadog",
    "name": "datadog.create_log_pipeline",
    "description": "Create and configure log processing pipelines for data transformation, enrichment, and routing. Supports custom processors, filtering rules, and output destinations. Returns pipeline configuration and processing statistics."
  },
  {
    "server": "datadog",
    "name": "datadog.create_dashboard",
    "description": "Create custom dashboards with widgets for metrics visualization, log analysis, and service monitoring. Supports multiple widget types, template variables, and sharing permissions. Returns dashboard configuration and access URLs."
  },
  {
    "server": "datadog",
    "name": "datadog.get_dashboard_data",
    "description": "Retrieve data for existing dashboards including widget values, time-series data, and current status information. Supports data export, snapshot generation, and automated reporting."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.create_incident",
    "description": "Create new incident alert with comprehensive details including severity, team, service association, and initial responder assignment. Supports automatic escalation triggers, stakeholder notifications, and integration with external monitoring systems. Returns incident details and response team assignments."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.get_incidents",
    "description": "Retrieve incidents with comprehensive filtering and sorting options. Returns incident details, timeline, responder information, and resolution status. Supports filtering by service, urgency, status, time range, and team assignment."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.update_incident",
    "description": "Update incident status, assignments, priority, and other properties with comprehensive change tracking and notification management. Supports bulk updates, automated workflows, and stakeholder communication."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.add_incident_note",
    "description": "Add detailed notes and updates to incidents including investigation findings, action items, and status updates. Supports rich text formatting, file attachments, and automatic timeline integration."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.get_oncall_schedule",
    "description": "Retrieve current and upcoming on-call schedules with detailed coverage information, escalation levels, and override details. Returns schedule entries, rotation patterns, and coverage gaps with notification preferences."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.create_override",
    "description": "Create temporary on-call schedule overrides for coverage during absences, special events, or maintenance windows. Supports recurring overrides, partial coverage, and automatic notifications to affected team members."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.manage_escalation_policy",
    "description": "Create and configure escalation policies defining response procedures, timeout intervals, and escalation levels. Supports complex escalation rules, notification methods, and integration with team structures."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.get_services",
    "description": "List all services with configuration details, integration status, and incident statistics. Returns service health metrics, escalation policy associations, and team ownership information with maintenance status."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.create_service",
    "description": "Create new services for incident management with integration setup, escalation policy assignment, and team ownership configuration. Supports service dependencies, maintenance windows, and monitoring integration."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.manage_service_dependencies",
    "description": "Configure and manage service dependencies for impact analysis and cascading incident management. Supports dependency mapping, impact assessment, and automated incident correlation."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.get_analytics",
    "description": "Retrieve comprehensive analytics including incident metrics, response times, service performance, and team effectiveness. Provides trend analysis, benchmark comparisons, and performance optimization recommendations."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.generate_incident_report",
    "description": "Generate detailed incident reports including timeline analysis, response effectiveness, and lessons learned. Supports custom report templates, automated scheduling, and stakeholder distribution."
  },
  {
    "server": "pagerduty",
    "name": "pagerduty.manage_integrations",
    "description": "Configure and manage integrations with monitoring tools, ticketing systems, and communication platforms. Supports integration health monitoring, configuration validation, and automated setup."
  },
  {
    "server": "zendesk",
    "name": "zendesk.search_tickets",
    "description": "Search tickets by customer, status, tags, priority, requester, assignee, custom fields, and time windows. Useful for triage and account overviews."
  },
  {
    "server": "zendesk",
    "name": "zendesk.create_ticket",
    "description": "Create a Zendesk ticket for customer requests, onboarding tasks, or proactive outreach."
  },
  {
    "server": "zendesk",
    "name": "zendesk.update_ticket",
    "description": "Update a ticket’s status, priority, fields, assignee, priority, or add tags. Supports internal/public comments."
  },
  {
    "server": "zendesk",
    "name": "zendesk.add_internal_note",
    "description": "Add a private internal note to a ticket (e.g., account context, renewal details, escalation notes)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.list_views",
    "description": "List Zendesk views available to the current user to understand queues and workload."
  },
  {
    "server": "zendesk",
    "name": "zendesk.get_view_tickets",
    "description": "Retrieve tickets belonging to a specific view (e.g., ‘VIP pending’, ‘Renewals this month’)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.bulk_update_tickets",
    "description": "Bulk update ticket fields, status, assignees, and tags—useful for campaign follow-ups or mass reassignments."
  },
  {
    "server": "zendesk",
    "name": "zendesk.apply_macro",
    "description": "Apply a macro to a ticket to standardize responses or field updates."
  },
  {
    "server": "zendesk",
    "name": "zendesk.list_macros",
    "description": "List available macros for the current user or group to speed up responses."
  },
  {
    "server": "zendesk",
    "name": "zendesk.users.get",
    "description": "Retrieve a user by id or email to view contact details, roles, and identity mapping."
  },
  {
    "server": "zendesk",
    "name": "zendesk.users.update",
    "description": "Update user properties such as role, tags, notes, or custom fields (e.g., success plan tier)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.organizations.get",
    "description": "Fetch organization details including domains, notes, custom fields, satisfaction, and ticket history summary."
  },
  {
    "server": "zendesk",
    "name": "zendesk.organizations.update",
    "description": "Update organization tags, notes, and custom fields (e.g., ARR, lifecycle stage, CSM owner)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.ticket_events.get",
    "description": "Retrieve a ticket’s event audit trail for timeline analyses and escalation reviews."
  },
  {
    "server": "zendesk",
    "name": "zendesk.escalate_ticket",
    "description": "Escalate a ticket to a higher-tier group, add critical tags, and notify stakeholders."
  },
  {
    "server": "zendesk",
    "name": "zendesk.satisfaction.list",
    "description": "List CSAT survey results and ratings by ticket, requester, or time window."
  },
  {
    "server": "zendesk",
    "name": "zendesk.satisfaction.request_survey",
    "description": "Trigger or resend a satisfaction survey for a solved ticket (subject to Zendesk settings)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.explore.export_report",
    "description": "Export Explore (analytics) dashboards or queries for CSAT, SLA, backlog, and response metrics."
  },
  {
    "server": "zendesk",
    "name": "zendesk.manage_sla_policies",
    "description": "Create or update SLA policies for response and resolution targets by priority or channel."
  },
  {
    "server": "zendesk",
    "name": "zendesk.triggers.manage",
    "description": "Create, enable/disable, or update triggers for routing, notifications, and tagging automation."
  },
  {
    "server": "zendesk",
    "name": "zendesk.automations.manage",
    "description": "Create or update time-based automations (e.g., pending > 3 days -> reminder)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.views.export",
    "description": "Export a view’s results for offline analysis (e.g., backlog by account)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.talk.call_logs",
    "description": "Retrieve Zendesk Talk call logs for a customer or timeframe to correlate with ticket history."
  },
  {
    "server": "zendesk",
    "name": "zendesk.chat.transcripts",
    "description": "Fetch live chat or messaging transcripts for a user, ticket, or timeframe for QBRs and RCA."
  },
  {
    "server": "zendesk",
    "name": "zendesk.help_center.search_articles",
    "description": "Search Help Center articles for enablement and self-serve guidance to share with customers."
  },
  {
    "server": "zendesk",
    "name": "zendesk.help_center.create_article",
    "description": "Create a Help Center article draft for onboarding guides, FAQs, or playbooks."
  },
  {
    "server": "zendesk",
    "name": "zendesk.help_center.update_article",
    "description": "Update or publish an existing Help Center article (e.g., add release notes, fix steps)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.followup.create",
    "description": "Create a follow-up ticket from a closed ticket for proactive checks or action items."
  },
  {
    "server": "zendesk",
    "name": "zendesk.tags.report",
    "description": "Aggregate tag usage across tickets to surface themes (bugs, feature requests, onboarding issues)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.workspace.assign_tickets",
    "description": "Bulk assign tickets to agents or groups based on rules (round-robin, capacity, specialty)."
  },
  {
    "server": "zendesk",
    "name": "zendesk.requests.list_for_customer",
    "description": "List all requests created by or for a specific customer to prepare for EBR/QBRs."
  },
  {
    "server": "zendesk",
    "name": "zendesk.sunshine.profiles.get",
    "description": "Retrieve Sunshine custom profiles (accounts, contacts) to enrich the customer 360 view."
  },
  {
    "server": "zendesk",
    "name": "zendesk.sunshine.events.list",
    "description": "List Sunshine events (e.g., product usage, billing milestones) for an account timeline."
  },
  {
    "server": "zendesk",
    "name": "zendesk.ticket_side_conversations.create",
    "description": "Start a side conversation (email/Slack) with internal/external stakeholders from a ticket."
  },
  {
    "server": "zendesk",
    "name": "zendesk.ticket_attachments.upload",
    "description": "Upload and attach files (logs, screenshots, QBR decks) to a ticket."
  },
  {
    "server": "zendesk",
    "name": "zendesk.nps.send_survey",
    "description": "Send an NPS survey to a list of users or an organization and track responses."
  },
  {
    "server": "zendesk",
    "name": "zendesk.nps.results",
    "description": "Retrieve NPS results and breakdown (promoters, passives, detractors) over time."
  },
  {
    "server": "zendesk",
    "name": "zendesk.ticket_fields.manage",
    "description": "Create or update custom ticket fields used for success plans, churn risk, or onboarding stage."
  },
  {
    "server": "zendesk",
    "name": "zendesk.ticket_merge",
    "description": "Merge duplicate tickets (e.g., multiple emails from same user) while preserving comments and attachments."
  },
  {
    "server": "zendesk",
    "name": "zendesk.subscriptions.ticket_updates",
    "description": "Subscribe to ticket updates that match a filter and stream changes for real-time account monitoring."
  },
  {
    "server": "zendesk",
    "name": "zendesk.side_load_customer_timeline",
    "description": "Compile a customer timeline (tickets, calls, chats, Sunshine events) for QBR/EBR packets."
  },
  {
    "server": "zendesk",
    "name": "zendesk.integrations.link_ticket",
    "description": "Link a Zendesk ticket to external systems (e.g., Jira issue, Salesforce case) and sync metadata."
  },
  {
    "server": "zendesk",
    "name": "zendesk.schedule_qbr_report",
    "description": "Generate and schedule a QBR/EBR packet using Zendesk Explore and Help Center content for a given account."
  },
  {
    "server": "zendesk",
    "name": "zendesk.requests.create_onboarding",
    "description": "Create a structured onboarding request set (tickets + tasks) for a new customer with templates."
  },
  {
    "server": "zendesk",
    "name": "zendesk.audit_logs.search",
    "description": "Search admin audit logs for configuration changes affecting workflows or SLAs."
  },
  {
    "server": "hubspot",
    "name": "hubspot.contacts.search",
    "description": "Search contacts by email, name, lifecycle stage, owner, domain, or custom properties."
  },
  {
    "server": "hubspot",
    "name": "hubspot.contacts.get",
    "description": "Get a single contact by ID or email with selected properties."
  },
  {
    "server": "hubspot",
    "name": "hubspot.contacts.create_or_update",
    "description": "Create or update a contact (upsert by email) including custom properties and owner assignment."
  },
  {
    "server": "hubspot",
    "name": "hubspot.contacts.merge",
    "description": "Merge a secondary contact into a primary contact, preserving history and associations."
  },
  {
    "server": "hubspot",
    "name": "hubspot.companies.search",
    "description": "Search companies by name, domain, owner, lifecycle stage, ARR, or custom properties."
  },
  {
    "server": "hubspot",
    "name": "hubspot.companies.create_or_update",
    "description": "Create or update a company (upsert by domain) and set CSM-related properties (e.g., tier, risk)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.associations.link",
    "description": "Create or update associations between records (e.g., contact↔company, ticket↔company)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.deals.search",
    "description": "Search deals by pipeline, stage, amount, renewal date, or company."
  },
  {
    "server": "hubspot",
    "name": "hubspot.deals.create_or_update",
    "description": "Create or update a deal (e.g., renewal or expansion) and associate to company/contacts."
  },
  {
    "server": "hubspot",
    "name": "hubspot.tickets.search",
    "description": "Search Service Hub tickets by status, pipeline, SLA, priority, or customer."
  },
  {
    "server": "hubspot",
    "name": "hubspot.tickets.create_or_update",
    "description": "Create or update a ticket and associate it with company, contact, and deal where relevant."
  },
  {
    "server": "hubspot",
    "name": "hubspot.tasks.create",
    "description": "Create tasks for follow-ups, onboarding steps, or renewal prep and assign to owners with due dates."
  },
  {
    "server": "hubspot",
    "name": "hubspot.engagements.log_note",
    "description": "Log a note on a contact, company, deal, or ticket (e.g., meeting summary, risk update)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.meetings.create_engagement",
    "description": "Create a past or scheduled meeting engagement with attendees and outcomes."
  },
  {
    "server": "hubspot",
    "name": "hubspot.properties.get",
    "description": "Get property definitions for a given object type (contacts, companies, deals, tickets, custom)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.properties.manage",
    "description": "Create, update, or archive a property on a standard or custom object."
  },
  {
    "server": "hubspot",
    "name": "hubspot.workflows.enroll",
    "description": "Enroll records into a HubSpot workflow (e.g., onboarding, renewal nurture, escalation alerts)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.workflows.manage",
    "description": "Enable/disable a workflow and update enrollment triggers or actions."
  },
  {
    "server": "hubspot",
    "name": "hubspot.lists.search_static",
    "description": "Find or create static lists for outreach cohorts (e.g., VIP customers, at-risk accounts)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.lists.add_records",
    "description": "Add records (contacts/companies) to a static list by IDs or emails/domains."
  },
  {
    "server": "hubspot",
    "name": "hubspot.sequences.enroll_contacts",
    "description": "Enroll contacts into a sales/service sequence for onboarding nudges or renewal reminders."
  },
  {
    "server": "hubspot",
    "name": "hubspot.feedback_surveys.send",
    "description": "Send CSAT/NPS/CES feedback surveys and associate responses to contacts/companies."
  },
  {
    "server": "hubspot",
    "name": "hubspot.feedback_surveys.results",
    "description": "Retrieve survey results and time-series breakdown for CSAT/NPS/CES."
  },
  {
    "server": "hubspot",
    "name": "hubspot.playbooks.log_call_note",
    "description": "Open a playbook and log structured notes to a record (contact/company/deal/ticket)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.quotes.create",
    "description": "Create a quote for renewal or expansion and associate to deals/companies/contacts."
  },
  {
    "server": "hubspot",
    "name": "hubspot.products.list",
    "description": "List products and price book entries for packaging renewals or expansions."
  },
  {
    "server": "hubspot",
    "name": "hubspot.line_items.add_to_deal",
    "description": "Attach product line items to a deal (quantity, term, discounts)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.pipelines.stages.update",
    "description": "Update a pipeline stage (e.g., Deal or Ticket stages) and stage order."
  },
  {
    "server": "hubspot",
    "name": "hubspot.reports.export",
    "description": "Export a HubSpot report or dashboard to CSV/PDF with optional filters for QBR packs."
  },
  {
    "server": "hubspot",
    "name": "hubspot.timeline.events.list",
    "description": "List recent activities across objects (emails, calls, meetings, notes) for an account timeline."
  },
  {
    "server": "hubspot",
    "name": "hubspot.subscription_preferences.update",
    "description": "Update a contact’s email subscription preferences (e.g., service updates, renewal reminders)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.tickets.sla_breaches.report",
    "description": "Report on SLA breaches and at-risk tickets by pipeline, owner, or company."
  },
  {
    "server": "hubspot",
    "name": "hubspot.custom_objects.search",
    "description": "Search custom objects (e.g., subscriptions, projects, usage) tied to CSM workflows."
  },
  {
    "server": "hubspot",
    "name": "hubspot.custom_objects.create_or_update",
    "description": "Create or update a custom object record (e.g., Success Plan, Subscription) and manage associations."
  },
  {
    "server": "hubspot",
    "name": "hubspot.integrations.salesforce.sync_status",
    "description": "Check Salesforce↔HubSpot sync health for a record or object type (helpful for data parity before QBRs)."
  },
  {
    "server": "hubspot",
    "name": "hubspot.emails.send_template",
    "description": "Send a templated email from a connected inbox to contacts with personalization tokens."
  },
  {
    "server": "hubspot",
    "name": "hubspot.owners.list",
    "description": "List HubSpot owners (users) for assignment, territory routing, and reporting."
  },
  {
    "server": "hubspot",
    "name": "hubspot.deals.renewal_forecast",
    "description": "Generate a renewal/expansion forecast from deals by close date, stage, and probability."
  },
  {
    "server": "hubspot",
    "name": "hubspot.tickets.bulk_update",
    "description": "Bulk update ticket properties (status, priority, owner) for backlog grooming and triage."
  },
  {
    "server": "hubspot",
    "name": "hubspot.webhooks.subscribe",
    "description": "Subscribe a webhook to record changes (tickets, deals, contacts) to power real-time alerts."
  },
  {
    "server": "hubspot",
    "name": "hubspot.imports.bulk_upsert",
    "description": "Import CSV data to upsert contacts/companies/deals/tickets with property mappings."
  },
  {
    "server": "hubspot",
    "name": "hubspot.ticket_snippets.apply",
    "description": "Insert a saved snippet into a ticket reply for standardized responses."
  },
  {
    "server": "hubspot",
    "name": "hubspot.kb.search_articles",
    "description": "Search Knowledge Base articles to share with customers for faster resolution."
  },
  {
    "server": "hubspot",
    "name": "hubspot.success_plans.generate",
    "description": "Create or refresh a Success Plan custom object with goals, milestones, owners, and risks."
  },
  {
    "server": "hubspot",
    "name": "hubspot.renewals.watchlist.build",
    "description": "Compile a watchlist of renewals and risk signals (usage drop, low CSAT, no activity) across accounts."
  },
  {
    "server": "hubspot",
    "name": "hubspot.user_events.usage_ingest",
    "description": "Upsert product usage or events (by contact or company) into a custom timeline or object."
  },
  {
    "server": "hubspot",
    "name": "hubspot.files.upload",
    "description": "Upload files (QBR decks, proposals, guides) and associate to records."
  },
  {
    "server": "hubspot",
    "name": "hubspot.tickets.side_conversations.create",
    "description": "Start a side conversation (email/Slack) from a ticket and keep transcript in HubSpot."
  },
  {
    "server": "hubspot",
    "name": "hubspot.alerts.create_risk_alert",
    "description": "Create a risk alert (internal task/email) when churn signals are detected for a company."
  }
]